# -*- coding: utf-8 -*-
import sys
import random

angry = ["(૭ ◉༬◉)૭⁾⁾⁾⁾"]
evil = ["↜(͛ ꒪͒৫͏̈́꒪͒)͛⌰"]
food = ["( ˘▽˘)っ♨"]
excited = ["(ﾉ･ｪ･)ﾉ",
"(/^▽^)/",
"(ﾉ´ヮ´)ﾉ*:･ﾟ✧",
"(ﾉ≧∀≦)ﾉ",
"(ﾉ^ヮ^)ﾉ*:・ﾟ✧",
"(/ ‘з’)/",
"(۶ꈨຶꎁꈨຶ )۶ʸᵉᵃʰᵎ",
"⁽(◍˃̵͈̑ᴗ˂̵͈̑)⁽",
"(╯✧∇✧)╯",
"Σ(ノ°▽°)ノ",
"( ƅ°ਉ°)ƅ",
"ヽ(　･∀･)ﾉ",
"˭̡̞(◞⁎˃ᆺ˂)◞*✰",
"(p^-^)p",
"(ﾉ^∇^)ﾉﾟ",
"ヽ(〃･ω･)ﾉ",
"(۶* ‘ꆚ’)۶”",
"（。＞ω＜）。",
"（ﾉ｡≧◇≦）ﾉ",
"ヾ(｡･ω･)ｼ",
"(ﾉ･д･)ﾉ",
".+:｡(ﾉ･ω･)ﾉﾞ",
"Σ(*ﾉ´&gt;ω&lt;｡`)ﾉ",
"ヾ（〃＾∇＾）ﾉ♪",
".ﾟ☆(ノё∀ё)ノ☆ﾟ.",
"⌒ﾟ(❀&gt;◞౪◟&lt;)ﾟ⌒",
"ヽ/❀o ل͜ o\ﾉ",
"⤴︎ ε=ε=(ง ˃̶͈̀ᗨ˂̶͈́)۶ ⤴︎",
"୧༼✿ ͡◕ д ◕͡ ༽୨"]

emotions = {"excited":excited}

def get_ran_emot(emotion):
    return random.sample(emotions[emotion],1)[0]